/* За допомогою prompt дізнайтесь число, введене користувачем. За допомогою if перевірте, чи число коректно
 перетворено з рядка. У разі помилки виведіть повідомлення Виведіть парне число чи ні, використовуючи if. */

let user_number = Number(prompt("Введите число"));

if (isNaN(user_number)) {
  alert("Вы ввели не число");
} else {
  alert("Спасибо за ответ");
}

let pairing = user_number % 2;
if (pairing == 0) {
  alert("Вы ввели парное число");
} else {
  alert("Вы ввели не парное число");
}

/* Запитайте у користувача текст і перевірте його на наявність некоректного
 слова або кількох некоректних слів. Використовуйте метод indexOf (або includes) рядки: */

let filthy_language = prompt("Только не матюкайся");
let arr = ["блять", "пиздец", "ахуй", "пидор", "ебать"];

let contains_filthy_language = arr.some((word) =>
  filthy_language.includes(word)
);
if (contains_filthy_language) {
  alert("Не матюкайся");
} else {
  alert("Добро пожаловать");
}

/* Напишіть код, який запитує ті чи інші 
питання з відповіддю "так"/"ні" за допомогою confirm, і зберігає відповіді в змінних. */

let result = confirm("Пошли пить?");
if (result == true) {
  alert("четко");
} else {
  alert("без тебя справлюсь");
}

/* Запитайте у користувача стать (confirm). 
Виведіть за допомогою alert "Ви чоловік" або "Ви жінка". Використовуйте тернарний оператор. */

let sex = confirm("Если вы женщина нажмите ОК, если мужчина нажмите cancel")
  ? "Вы женщина"
  : "Вы мужчина";
alert(sex);

/* Для завдання Number: age використовуючи АБО || вивести повідомлення про помилку (alert) якщо користувач не 
введе 
вік або натисне скасування (тобто prompt видасть порожній рядок або null, що інтерпретується як false). */

let age = prompt("Your age?");
if (age === null || age === "") {
  alert("Ви не вказали свій вік");
}

/*
За допомогою цього ж трюку (використання АБО для запуску альтернативи) зробіть примхливого робота,
 який у confirm запитує "шопінг?", а у разі відмови - виводити alert "ти - бяка".
*/

confirm("шопінг?") || alert("ты бяка");

/* Зробити те саме за допомогою if. */

let shopping = confirm("шопінг?");

if (shopping === false) {
  alert("ты бяка");
}

/* Попросіть користувача ввести ПІБ в три різні змінні.
 Використовуючи АБО || додайте рядки за промовчанням, які будуть зберігатися у внутрішніх
  змінних якщо користувач ввів порожній рядок або натиснув "Скасувати". Наприклад, якщо ви 
  на кроці введення прізвища натиснете Escape, прізвище буде "Іванов" */

let surname = prompt("Введите вашу фамилию") || "Иванов";
let name = prompt("Введите ваше имя") || "Иван";
let second_name = prompt("Введите ваше отчество") || "Иванович";

/* Зробіть те саме за допомогою if та else */

let surname = prompt("Введите вашу фамилию");
let name = prompt("Введите ваше имя");
let second_name = prompt("Введите ваше отчество");

if (surname === null || surname === "") {
  surname = "Иванов";
}

if (name === null || name === "") {
  name = "Иван";
}

if (second_name === null || second_name === "") {
  second_name = "Иванович";
}

/* Напишіть код, який запитує логін, перевіряє його на вірність, якщо логін вірний,
 просить ввести пароль і перевіряє його. В разі розбіжності логіну чи
  пароля виводити alert з текстом помилки. У разі успішного логіну – alert з привітанням.
   Правильні логін: admin та пароль: qwerty. Використовуйте вкладені if та else. */

let login = "admin";
let password = "qwerty";

let rightLogin = prompt("Введите логин");

if (rightLogin === login) {
  let rightPassword = prompt("Введите пароль");

  if (rightPassword === password) {
    alert("Добро пожаловать");
  } else {
    alert("Неправильный пароль");
  }
} else if (login === null || login === "") {
  alert("Вы нажали отменить");
} else {
  alert("Такого пользователя нет");
}

/* 
- Попросіть користувача ввести валюту (наприклад, usd, eur, інші валюти додати до смаку) за допомогою prompt.
- Також поцікавтеся купити чи продати він бажає (використовуйте confirm).
- За допомогою декількох if та тернарного оператора всередині кожного з if 
задайте змінну rate, визначальну курс конкретної валюти на купівлю чи продаж. 
Зверніть увагу на місце оголошення змінної rate - вона має бути доступна в коді після всіх цих if.
- Попросіть користувача ввести суму на обмін
- Порахуйте та виведіть результат шляхом множення або поділу на rate
- Дайте можливість користувачеві вводити назви валют у будь-якому регістрі (UsD, eUR). 
Для цього в if використовуйте toUpperCase (або toLowerCase) */

let currency = prompt(
  "Введите валюту которую хотите продать или купить: usd / eur?"
).toLowerCase();
let action = confirm(
  "Если хотите купить нажмите Ok, если хотите продать нажмите cancel"
);

let rate = 0;

if (currency === "usd") {
  rate = action ? 39 : 35;
} else if (currency === "eur") {
  rate = action ? 29 : 25;
}

let sum = prompt("Введите сумму покупки или продажи");
let result = action ? sum / rate : sum * rate;

/* Зробіть гру "камінь-ножиці-папір". Користувач вводить свій варіант через prompt,
 програма генерує свій варіант через Math.random() і виводить через alert.
  Наступний alert виводить ім'я переможця чи "нічия" */

let choicePlayer = prompt("Введити камень, ножницы или бумага");

let game = ["камень", "ножницы", "бумага"];

let choiceProgram = Math.floor(Math.random() * game.length);

if (game[choiceProgram] === choicePlayer) {
  alert("ничья");
} else if (
  (game[choiceProgram] === "камень" && choicePlayer === "ножницы") ||
  (game[choiceProgram] === "ножницы" && choicePlayer === "бумага") ||
  (game[choiceProgram] === "бумага" && choicePlayer === "камень")
) {
  alert("Выиграл компьютер");
} else if (
  (game[choiceProgram] === "камень" && choicePlayer === "бумага") ||
  (game[choiceProgram] === "ножницы" && choicePlayer === "камень") ||
  (game[choiceProgram] === "бумага" && choicePlayer === "ножницы")
) {
  alert("Выиграл игрок");
}
