/* Дослідіть код, знайдіть вирази у ньому. Розставте дужки так, щоб код не змінив своєї поведінки (працював так само як і зараз). Поясніть, як і в якому порядку обчислюються вирази та вирази. */
/*
let a = 5;
let b, c;

b = a * 5;
c = b / 2;
*/
/* За допомогою prompt запитати у користувача його вік та підрахувати рік народження.
 Рік народження вивести за допомогою alert. */
/*
 let age = prompt('Введите ваш возраст');
 let yearNow = '2023';
 alert(yearNow - age + ' Ваш год рождения');
*/
/* За допомогою prompt запитати у користувача температуру
  в градусах Цельсія та перевести їх у Фаренгейти та/або навпаки. */

/*
  let degrees = prompt('Сколько градусов Цельсия вы хотите перевести в Фаренгейти');

  alert(((degrees * 9) / 5) + 32 + ' Градусов по Фаренгейту');
*/

/* Зробіть калькулятор для розрахунку поділу націло двох чисел. Використовуйте Math.floor або альтернативи. */
/*
let number1 = prompt('Введите первое число');
let number2 = prompt('Введите второе число');
let result = Math.floor(number1 / number2);
alert(result);
*/

/* Напишіть код, який обчислює обмін валют за курсом, заданим за допомогою
 константи const rate = КУРС ВАЛЮТИ Вважайте значення в одній валюті за допомогою 'prompt',
  після чого помножіть/поділіть це число на 'rate'. Виведіть результат, використовуючи alert.
   Обмежте кількість знаків після коми двома (нас не хвилюють дрібні частини центів/копійок) */
/*
   const rate = 37.8;

   let amount = prompt("Введіть суму в доларах:");
   
   let exchange = amount * rate;
   
   exchange = exchange.toFixed(2);
   
   alert("Ви отримаєте " + exchange + " гривень ");
*/

/* Зробіть калькулятор, який дозволить вам виходячи з інформації про кількість поверхів
 у будинку та кількість квартир на поверсі знаходити під'їзд та поверх певної квартири за
  її номером. Наприклад для 9поверхового будинку по 4 квартири на поверх 81 квартира знаходиться
   на 3-му поверсі третього під'їзду. Користувач повинен вводити за допомогою prompt кiлькiсть поверхiв,
    кiлькiсть квартир на поверсi та номер квартири. Код повинен видавати пiд'їзд та поверх по номеру квартири. */

let floor = Number(prompt("floor")); //сколько этажей в доме//
let numF = Number(prompt("flats")); // количество квартир на этаже//
let flat = Number(prompt("flat")); // номер квартиры //

let blockF = Math.ceil(flat / (floor * numF)); // номер подъезда
alert(blockF);

let flatF = (flat / numF) % floor;
if (flatF === 0) {
  alert(floor);
} else {
  alert(Math.ceil(flatF));
}
